#+title: vct's dotfiles

This is my dotfiles repo. I hope you find something useful here!

* Dependencies

- [[https://www.gnu.org/software/make/][GNU Make]]
- [[https://www.gnu.org/software/stow/][GNU Stow]]

* How it works

it's been said of every console user: 
> _"you are your dotfiles"_.

I manage my dotfiles with [[http://www.gnu.org/software/stow/][GNU Stow]], a free, portable, lightweight symlink farm manager. this allows me to keep a versioned directory of all my config files that are virtually linked into place via a single command. this makes sharing these files among many users (root) and computers super simple.

GNU stow is [[https://repology.org/project/stow/versions][available for all linux]] and most other unix like distributions via your package manager:

- =emerge app-admin/stow=
- =sudo pacman -S stow=
- =sudo apt-get install stow=
- =brew install stow=

or clone it [[https://savannah.gnu.org/git/?group=stow][from source]] and [[http://git.savannah.gnu.org/cgit/stow.git/tree/INSTALL][build it]].

**Note:** stow can only create a symlink if a config file does not already exist. if a default file was created upon program installation you must delete it first before you can install a new one with stow. this does not apply to directories, only files.

** Configuration files

#+begin_src bash :results output
tree -a */
#+end_src

#+RESULTS:
#+begin_example
bash/
├── .bash_profile
├── .bashrc
├── .config
│   └── bash
│       ├── 00-history.bash
│       ├── 00-pager.bash
│       └── 00-prompt.bash
├── .dir_colors
└── .inputrc
environment/
├── .guile
├── .psqlrc
├── .Renviron
└── .Rprofile
git/
└── config
ranger/
├── .config
│   └── ranger
│       ├── commands_full.py
│       ├── commands.py
│       ├── rc.conf
│       ├── rifle.conf
│       └── scope.sh
└── .ranger_automatic_cd.sh
redshift/
└── redshift.conf
tmux/
└── .tmux.conf
vim/
└── .vimrc
xmonad/
├── dunst
│   └── dunstrc
├── picom
│   └── picom.conf
├── rofi
│   └── config.rasi
└── xmonad
    ├── .config
    │   └── polybar
    │       ├── config
    │       └── launch.sh
    ├── .stalonetrayrc
    └── .xmonad
        └── xmonad.hs
xresources/
├── .local
│   └── bin
│       └── vctterminal
├── .Xresources
└── .Xresources.d
    ├── base16-solarized-light.Xresources
    └── nord.Xresources
xterm/
└── xterm.Xresources

14 directories, 33 files
#+end_example

* Instructions

*Warning*: If you want to give these dotfiles a try, you should first fork this repository, review the code, and remove things you don’t want or need. Don’t blindly use my settings unless you know what that entails. Use at your own risk!

Clone the repository in a folder in your =$HOME= (I usually keep it as a hidden directory =.dotfiles=, but you can put it anywhere):
#+begin_src bash
git clone https://gitlab.com/padawanphysicist/dotfiles.git ~/.dotfiles
#+end_src

then enter the directory,
#+begin_src bash
cd ~/.dotfiles
#+end_src

and create the symlinks to your =$HOME= directory:
#+begin_src sh
make all
#+end_src

You can also install each package separately: to install configuration files for git for example:
#+begin_src bash
make git
#+end_src

* Disclaimer

This is a laboratory for experimenting my computing environment. Ultimately, this is only meant to work for me. So, probably there won't be any support to anyone tracking this repository.

So, although I really you find something useful here, use this at your own risk! 
